# Join

In [1]:
import pandas as pd

In [16]:
var1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,12,13,14]},index = ["a", "b", "c", "d"])
var2 = pd.DataFrame({"C":[21,22,23],"D": [31,32,33]}, index = ["a", "b", "c"])

In [17]:
var1.join(var2)

   A   B     C     D
a  1  11  21.0  31.0
b  2  12  22.0  32.0
c  3  13  23.0  33.0
d  4  14   NaN   NaN